[
  {"id":"aristoteApplicationsCategoricalFramework2022","abstract":"M2 internship report. We extend Petrişan and Colcombet's categorical framework for automata minimization and learning with new categorical algorithms and apply it to various families of automata for which minimization and learning had not been studied previously. We focus on transducers whose output lie in arbitrary monoids, weighted automata on Dedekind domains and automata whose states are quasi-ordered. This last example links automata learning together with the Valk-Jantzen lemma, widely used in the theory of well-structured transition systems.","author":[{"family":"Aristote","given":"Quentin"}],"citation-key":"aristoteApplicationsCategoricalFramework2022","issued":{"date-parts":[[2022,8,20]]},"language":"en","license":"All rights reserved","title":"Applications of a categorical framework for minimization and active learning of transition systems","type":"report","URL":"https://git.eleves.ens.fr/qaristote/m2-internship-report/uploads/2594114883f26d77c2b4f3731656351a/report.pdf"},
  {"id":"aristoteDynamicalTriangulationInduced2020","abstract":"We present the single-particle sector of a quantum cellular automaton, namely a quantum walk, on a simple dynamical triangulated 2-manifold. The triangulation is changed through Pachner moves, induced by the walker density itself, allowing the surface to transform into any topologically equivalent one. This model extends the quantum walk over triangular grid, introduced in a previous work, by one of the authors, whose space-time limit recovers the Dirac equation in (2+1)-dimensions. Numerical simulations show that the number of triangles and the local curvature grow as exp(a log(t) - bt²), where a and b parametrize the way geometry changes upon the local density of the walker, and that, in the long run, flatness emerges. Finally, we also prove that the global behavior of the walker, remains the same under spacetime random fluctuations.","accessed":{"date-parts":[[2020,8,17]]},"author":[{"family":"Aristote","given":"Quentin"},{"family":"Eon","given":"Nathanaël"},{"family":"Di Molfetta","given":"Giuseppe"}],"citation-key":"aristoteDynamicalTriangulationInduced2020","container-title":"Symmetry","DOI":"10.3390/sym12010128","ISSN":"2073-8994","issue":"1:128","issued":{"date-parts":[[2020,1]]},"language":"en","license":"http://creativecommons.org/licenses/by/3.0/","number":"1","publisher":"Multidisciplinary Digital Publishing Institute","source":"www.mdpi.com","title":"Dynamical Triangulation Induced by Quantum Walk","type":"article-journal","URL":"https://www.mdpi.com/2073-8994/12/1/128","volume":"12"},
  {"id":"aristoteFibrationalFrameworkNested2020","abstract":"M1 internship report. We extend a previous fibration- and coalgebra-based categorical framework for characterizing greatest fixed-points, e.g. bisimilarity-like notions, as winning positions in safety games. Our new framework thus characterizes nested alternating greatest and smallest fixed-points of a fibration- and coalgebra-based categorical operator as winning positions in parity games. This provides a new kind of parity games for the model checking of coalgebraic modal logic, but unfortunately we did not manage to instantiate more general notions of bisimulations such as fair and delayed bisimulations.","author":[{"family":"Aristote","given":"Quentin"}],"citation-key":"aristoteFibrationalFrameworkNested2020","issued":{"date-parts":[[2020,8,28]]},"language":"en","license":"All rights reserved","title":"Fibrational Framework for Nested Alternating Fixed Points and (Bi)Simulation Notions for Büchi Automata","type":"report","URL":"https://git.eleves.ens.fr/qaristote/m1-internship-report/uploads/3431548a277eb5fc297d8e7d93d1e3ce/aristote_quentin_m1_internship_report.pdf"},
  {"id":"aristoteMarcheQuantiqueReseau2019","abstract":"Rapport de stage de L3. On introduit un automate cellulaire quantique à une particule, un marcheur quantique, sur une variété triangulée de dimension 2. La triangulation change à travers des Pachner moves, induits eux-même par la densité du marcheur, permettant à la surface de se transformer en n'importe quelle autre surface qui lui est topologiquement équivalente. Ce modèle généralise le marcheur quantique sur un réseau triangulaire, introduit dans un article précédent par un des auteurs, et dont la limite en espace-temps retombe sur l'équation de Dirac en 2+1 dimensions.\nDes simulations numériques montrent que le nombre de triangles et que la courbure évoluent en  exp(a log(t) - bt²), où a et b paramétrisent la façon dont la géométrie change selon la densité locale du marcheur, et que, sur le long terme, la surface redevient plate. Enfin, on montre aussi numériquement que le comportement global du marcheur reste le même sous l'influence de fluctuations spatio-temporelles aléatoires.","author":[{"family":"Aristote","given":"Quentin"}],"citation-key":"aristoteMarcheQuantiqueReseau2019","issued":{"date-parts":[[2019,8,25]]},"language":"fr","license":"All rights reserved","page":"15","title":"Marche quantique sur un réseau triangulaire sujet à des Pachner moves","type":"report","URL":"https://git.eleves.ens.fr/qaristote/rapport-stage-l3/-/raw/b9f9cc78ad3eabe6508be70cc27dc9bf89d34755/rapport.pdf"}
]
