[
  {"id":"aristoteFunctorialApproachMinimizing2023","abstract":"We study monoidal transducers, transition systems arising as deterministic automata whose transitions also produce outputs in an arbitrary monoid, for instance allowing outputs to commute or to cancel out. We use the categorical framework for minimization and learning of Colcombet, Petrişan and Stabile to recover the notion of minimal transducer recognizing a language, and give necessary and sufficient conditions on the output monoid for this minimal transducer to exist and be unique (up to isomorphism). The categorical framework then provides an abstract algorithm for learning it using membership and equivalence queries, and we discuss practical aspects of this algorithm's implementation. We also extend the framework with a categorical algorithm for minimizing transition systems, whose instantiation retrieves the algorithm for minimizing monoidal transducers but also extends the class of output monoids for which this algorithm is valid.","accessed":{"date-parts":[["2023",7,27]]},"author":[{"family":"Aristote","given":"Quentin"}],"citation-key":"aristoteFunctorialApproachMinimizing2023","issued":{"date-parts":[["2023",7,27]]},"language":"en","number":"04172251","publisher":"HAL","title":"Functorial approach to minimizing and learning deterministic transducers with outputs in arbitrary monoids","type":"article","URL":"https://hal.science/hal-04172251"},
  {"id":"aristoteMonotoneWeakDistributive2024","abstract":"Noticing the similarity between the monotone weak distributive laws combining two layers of nondeterminisms in sets and in compact Hausdorff spaces, we study whether the latter law can be obtained automatically as a weak lifting of the former. This holds partially, but does not generalize to other categories of algebras: we then characterize when exactly monotone weak distributive laws over powerset monads in categories of algebras exist, exhibiting a law combining probabilities and non-determinism in compact Hausdorff spaces and showing on the other hand that such laws do not exist in a lot of other cases.","accessed":{"date-parts":[["2024",11,4]]},"author":[{"family":"Aristote","given":"Quentin"}],"citation-key":"aristoteMonotoneWeakDistributive2024","issued":{"date-parts":[["2024",10]]},"language":"en","title":"Monotone weak distributive laws over the lifted powerset monad in categories of algebras","type":"article","URL":"https://hal.science/hal-04712728v5"},
  {"id":"aristoteSmtlibbackendsFasterSMTLIBbased2023","abstract":"Announcement of smtlib-backends, a Haskell library providing a generic interface for interacting with SMT solvers using SMT-LIB.","author":[{"family":"Aristote","given":"Quentin"}],"citation-key":"aristoteSmtlibbackendsFasterSMTLIBbased2023","container-title":"Tweag Blog","issued":{"date-parts":[["2023",2,14]]},"language":"en","title":"smtlib-backends: faster SMT-LIB-based Haskell interface to SMT solvers","title-short":"smtlib-backends","type":"post-weblog","URL":"https://www.tweag.io/blog/2023-02-14-smtlib-backends"}
]
