[
  {"id":"aristoteActiveLearningDeterministic2024","abstract":"We study monoidal transducers, transition systems arising as deterministic automata whose transitions also produce outputs in an arbitrary monoid, for instance allowing outputs to commute or to cancel out. We use the categorical framework for minimization and learning of Colcombet, Petrişan and Stabile to recover the notion of minimal transducer recognizing a language, and give necessary and sufficient conditions on the output monoid for this minimal transducer to exist and be unique (up to isomorphism). The categorical framework then provides an abstract algorithm for learning it using membership and equivalence queries, and we discuss practical aspects of this algorithm’s implementation.","accessed":{"date-parts":[["2024",2,7]]},"author":[{"family":"Aristote","given":"Quentin"}],"citation-key":"aristoteActiveLearningDeterministic2024","collection-title":"Leibniz International Proceedings in Informatics (LIPIcs)","container-title":"32nd EACSL Annual Conference on Computer Science Logic (CSL 2024)","DOI":"10.4230/LIPIcs.CSL.2024.11","event-place":"Dagstuhl, Germany","event-title":"Computer Science Logic (CSL)","ISBN":"978-3-95977-310-2","ISSN":"1868-8969","issued":{"date-parts":[["2024"]]},"language":"en","note":"Helena Rasiowa award for the Best Student Paper","page":"11:1-11:20","publisher":"Schloss-Dagstuhl - Leibniz Zentrum für Informatik","publisher-place":"Dagstuhl, Germany","title":"Active Learning of Deterministic Transducers with Outputs in Arbitrary Monoids","type":"paper-conference","URL":"https://drops.dagstuhl.de/entities/document/10.4230/LIPIcs.CSL.2024.11","volume":"288"},
  {"id":"aristoteMonotoneWeakDistributive2025","abstract":"In both the category of sets and the category of compact Hausdorff spaces, there is a monotone weak distributive law that combines two layers of non-determinism. Noticing the similarity between these two laws, we study whether the latter can be obtained automatically as a weak lifting of the former. This holds partially, but does not generalize to other categories of algebras. We then characterize when exactly monotone weak distributive laws over powerset monads in categories of algebras exist, on the one hand exhibiting a law combining probabilities and non-determinism in compact Hausdorff spaces and showing on the other hand that such laws do not exist in a lot of other cases.","accessed":{"date-parts":[["2025",2,25]]},"author":[{"family":"Aristote","given":"Quentin"}],"citation-key":"aristoteMonotoneWeakDistributive2025","collection-title":"Leibniz International Proceedings in Informatics (LIPIcs)","container-title":"42nd International Symposium on Theoretical Aspects of Computer Science (STACS 2025)","DOI":"10.4230/LIPIcs.STACS.2025.10","editor":[{"family":"Beyersdorff","given":"Olaf"},{"family":"Pilipczuk","given":"Michał"},{"family":"Pimentel","given":"Elaine"},{"family":"Thắng","given":"Nguyễn Kim"}],"event-place":"Dagstuhl, Germany","event-title":"Symposium on Theoretical Aspects of Computer Science (STACS)","ISBN":"978-3-95977-365-2","ISSN":"1868-8969","issued":{"date-parts":[["2025"]]},"language":"en","page":"10:1–10:20","publisher":"Schloss Dagstuhl – Leibniz-Zentrum für Informatik","publisher-place":"Dagstuhl, Germany","title":"Monotone Weak Distributive Laws over the Lifted Powerset Monad in Categories of Algebras","type":"paper-conference","URL":"https://drops.dagstuhl.de/entities/document/10.4230/LIPIcs.STACS.2025.10","volume":"327"}
]
