[
  {"id":"aristoteActiveLearningDeterministic2024","abstract":"We study monoidal transducers, transition systems arising as deterministic automata whose transitions also produce outputs in an arbitrary monoid, for instance allowing outputs to commute or to cancel out. We use the categorical framework for minimization and learning of Colcombet, Petrişan and Stabile to recover the notion of minimal transducer recognizing a language, and give necessary and sufficient conditions on the output monoid for this minimal transducer to exist and be unique (up to isomorphism). The categorical framework then provides an abstract algorithm for learning it using membership and equivalence queries, and we discuss practical aspects of this algorithm’s implementation.","accessed":{"date-parts":[["2024",2,7]]},"author":[{"family":"Aristote","given":"Quentin"}],"citation-key":"aristoteActiveLearningDeterministic2024","collection-title":"Leibniz International Proceedings in Informatics (LIPIcs)","container-title":"32nd EACSL Annual Conference on Computer Science Logic (CSL 2024)","DOI":"10.4230/LIPIcs.CSL.2024.11","event-place":"Dagstuhl, Germany","event-title":"Computer Science Logic (CSL)","ISBN":"978-3-95977-310-2","ISSN":"1868-8969","issued":{"date-parts":[["2024"]]},"language":"en","note":"Helena Rasiowa award for the Best Student Paper","page":"11:1-11:20","publisher":"Schloss-Dagstuhl - Leibniz Zentrum für Informatik","publisher-place":"Dagstuhl, Germany","title":"Active Learning of Deterministic Transducers with Outputs in Arbitrary Monoids","type":"paper-conference","URL":"https://drops.dagstuhl.de/entities/document/10.4230/LIPIcs.CSL.2024.11","volume":"288"},
  {"id":"aristoteActiveLearningUpwardclosed2025","abstract":"We give a new proof of a result from well quasi-order theory on the computability of bases for upwards-closed sets of words. This new proof is based on Angluin's L∗L∗L^* algorithm, that learns an automaton from a minimally adequate teacher. This relates in particular two results from the 1980s: Angluin's L∗L∗L^* algorithm, and a result from Valk and Jantzen on the computability of bases for upwards-closed sets of tuples of integers.\n\nAlong the way, we describe an algorithm for learning quasi-ordered automata from a minimally adequate teacher, and extend a generalization of Valk and Jantzen's result, encompassing both words and integers, to finitely generated monoids.","accessed":{"date-parts":[["2025",5,6]]},"author":[{"family":"Aristote","given":"Quentin"}],"citation-key":"aristoteActiveLearningUpwardclosed2025","issued":{"date-parts":[["2025",4]]},"source":"HAL Archives Ouvertes","title":"Active learning of upward-closed sets of words","type":"manuscript","URL":"https://hal.science/hal-05051620"},
  {"id":"aristoteApplicationsCategoricalFramework2022","abstract":"M2 internship report. We extend Petrişan and Colcombet's categorical framework for automata minimization and learning with new categorical algorithms and apply it to various families of automata for which minimization and learning had not been studied previously. We focus on transducers whose output lie in arbitrary monoids, weighted automata on Dedekind domains and automata whose states are quasi-ordered. This last example links automata learning together with the Valk-Jantzen lemma, widely used in the theory of well-structured transition systems.","author":[{"family":"Aristote","given":"Quentin"}],"citation-key":"aristoteApplicationsCategoricalFramework2022","issued":{"date-parts":[["2022",8,20]]},"language":"en","license":"All rights reserved","publisher":"École Normale Supérieure, PSL University","title":"Applications of a categorical framework for minimization and active learning of transition systems","type":"report","URL":"https://git.eleves.ens.fr/qaristote/m2-internship-report/uploads/2594114883f26d77c2b4f3731656351a/report.pdf"},
  {"id":"aristoteDynamicalTriangulationInduced2020","abstract":"We present the single-particle sector of a quantum cellular automaton, namely a quantum walk, on a simple dynamical triangulated 2-manifold. The triangulation is changed through Pachner moves, induced by the walker density itself, allowing the surface to transform into any topologically equivalent one. This model extends the quantum walk over triangular grid, introduced in a previous work, by one of the authors, whose space-time limit recovers the Dirac equation in (2+1)-dimensions. Numerical simulations show that the number of triangles and the local curvature grow as exp(a log(t) - bt²), where a and b parametrize the way geometry changes upon the local density of the walker, and that, in the long run, flatness emerges. Finally, we also prove that the global behavior of the walker, remains the same under spacetime random fluctuations.","accessed":{"date-parts":[["2020",8,17]]},"author":[{"family":"Aristote","given":"Quentin"},{"family":"Eon","given":"Nathanaël"},{"family":"Molfetta","given":"Giuseppe","non-dropping-particle":"di"}],"citation-key":"aristoteDynamicalTriangulationInduced2020","container-title":"Symmetry","DOI":"10.3390/sym12010128","ISSN":"2073-8994","issue":"1:128","issued":{"date-parts":[["2020",1]]},"language":"en","license":"http://creativecommons.org/licenses/by/3.0/","number":"1","publisher":"Multidisciplinary Digital Publishing Institute","title":"Dynamical Triangulation Induced by Quantum Walk","type":"article-journal","URL":"https://www.mdpi.com/2073-8994/12/1/128","volume":"12"},
  {"id":"aristoteFibrationalFrameworkNested2020","abstract":"M1 internship report. We extend a previous fibration- and coalgebra-based categorical framework for characterizing greatest fixed-points, e.g. bisimilarity-like notions, as winning positions in safety games. Our new framework thus characterizes nested alternating greatest and smallest fixed-points of a fibration- and coalgebra-based categorical operator as winning positions in parity games. This provides a new kind of parity games for the model checking of coalgebraic modal logic, but unfortunately we did not manage to instantiate more general notions of bisimulations such as fair and delayed bisimulations.","author":[{"family":"Aristote","given":"Quentin"}],"citation-key":"aristoteFibrationalFrameworkNested2020","issued":{"date-parts":[["2020",8,28]]},"language":"en","license":"All rights reserved","title":"Fibrational Framework for Nested Alternating Fixed Points and (Bi)Simulation Notions for Büchi Automata","type":"report","URL":"https://git.eleves.ens.fr/qaristote/m1-internship-report/uploads/3431548a277eb5fc297d8e7d93d1e3ce/aristote_quentin_m1_internship_report.pdf"},
  {"id":"aristoteFunctorialApproachMinimizing2023","abstract":"We study monoidal transducers, transition systems arising as deterministic automata whose transitions also produce outputs in an arbitrary monoid, for instance allowing outputs to commute or to cancel out. We use the categorical framework for minimization and learning of Colcombet, Petrişan and Stabile to recover the notion of minimal transducer recognizing a language, and give necessary and sufficient conditions on the output monoid for this minimal transducer to exist and be unique (up to isomorphism). The categorical framework then provides an abstract algorithm for learning it using membership and equivalence queries, and we discuss practical aspects of this algorithm's implementation. We also extend the framework with a categorical algorithm for minimizing transition systems, whose instantiation retrieves the algorithm for minimizing monoidal transducers but also extends the class of output monoids for which this algorithm is valid.","accessed":{"date-parts":[["2023",7,27]]},"author":[{"family":"Aristote","given":"Quentin"}],"citation-key":"aristoteFunctorialApproachMinimizing2023","issued":{"date-parts":[["2023",7,27]]},"language":"en","number":"04172251","publisher":"HAL","title":"Functorial approach to minimizing and learning deterministic transducers with outputs in arbitrary monoids","type":"article","URL":"https://hal.science/hal-04172251"},
  {"id":"aristoteLearningWeightedAutomata2025","abstract":"We develop a generic reduction procedure for active learning problems. Our approach is inspired by a recent polynomial-time reduction of the exact learning problem for weighted automata over integers to that for weighted automata over rationals (Buna-Marginean et al. 2024). Our procedure improves the efficiency of a category-theoretic automata learning algorithm, and poses new questions about the complexity of its implementation when instantiated to concrete categories. As our second main contribution, we address these complexity aspects in the concrete setting of learning weighted automata over number rings, that is, rings of integers in an algebraic number field. Assuming a full representation of a number ring OK, we obtain an exact learning algorithm of OK-weighted automata that runs in polynomial time in the size of the target automaton, the logarithm of the length of the longest counterexample, the degree of the number field, and the logarithm of its discriminant. Our algorithm produces an automaton that has at most one more state than the minimal one, and we prove that doing better requires solving the principal ideal problem, for which the best currently known algorithm is in quantum polynomial time.","accessed":{"date-parts":[["2025",4,28]]},"author":[{"family":"Aristote","given":"Quentin"},{"family":"Gool","given":"Sam","dropping-particle":"van"},{"family":"Petrişan","given":"Daniela"},{"family":"Shirmohammadi","given":"Mahsa"}],"citation-key":"aristoteLearningWeightedAutomata2025","issued":{"date-parts":[["2025",1,24]]},"language":"en","number":"05040143","publisher":"HAL","title":"Learning Weighted Automata over Number Rings, Concretely and Categorically","type":"article","URL":"https://hal.science/hal-05040143"},
  {"id":"aristoteMarcheQuantiqueReseau2019","abstract":"Rapport de stage de L3. On introduit un automate cellulaire quantique à une particule, un marcheur quantique, sur une variété triangulée de dimension 2. La triangulation change à travers des Pachner moves, induits eux-même par la densité du marcheur, permettant à la surface de se transformer en n'importe quelle autre surface qui lui est topologiquement équivalente. Ce modèle généralise le marcheur quantique sur un réseau triangulaire, introduit dans un article précédent par un des auteurs, et dont la limite en espace-temps retombe sur l'équation de Dirac en 2+1 dimensions.\nDes simulations numériques montrent que le nombre de triangles et que la courbure évoluent en  exp(a log(t) - bt²), où a et b paramétrisent la façon dont la géométrie change selon la densité locale du marcheur, et que, sur le long terme, la surface redevient plate. Enfin, on montre aussi numériquement que le comportement global du marcheur reste le même sous l'influence de fluctuations spatio-temporelles aléatoires.","author":[{"family":"Aristote","given":"Quentin"}],"citation-key":"aristoteMarcheQuantiqueReseau2019","issued":{"date-parts":[["2019",8,25]]},"language":"en","license":"All rights reserved","title":"Marche quantique sur un réseau triangulaire sujet à des Pachner moves","type":"report","URL":"https://git.eleves.ens.fr/qaristote/rapport-stage-l3/-/raw/b9f9cc78ad3eabe6508be70cc27dc9bf89d34755/rapport.pdf"},
  {"id":"aristoteMonotoneWeakDistributive2024","abstract":"Noticing the similarity between the monotone weak distributive laws combining two layers of nondeterminisms in sets and in compact Hausdorff spaces, we study whether the latter law can be obtained automatically as a weak lifting of the former. This holds partially, but does not generalize to other categories of algebras: we then characterize when exactly monotone weak distributive laws over powerset monads in categories of algebras exist, exhibiting a law combining probabilities and non-determinism in compact Hausdorff spaces and showing on the other hand that such laws do not exist in a lot of other cases.","accessed":{"date-parts":[["2024",11,4]]},"author":[{"family":"Aristote","given":"Quentin"}],"citation-key":"aristoteMonotoneWeakDistributive2024","issued":{"date-parts":[["2024",10]]},"language":"en","title":"Monotone weak distributive laws over the lifted powerset monad in categories of algebras","type":"article","URL":"https://hal.science/hal-04712728v4"},
  {"id":"aristoteMonotoneWeakDistributive2025","abstract":"In both the category of sets and the category of compact Hausdorff spaces, there is a monotone weak distributive law that combines two layers of non-determinism. Noticing the similarity between these two laws, we study whether the latter can be obtained automatically as a weak lifting of the former. This holds partially, but does not generalize to other categories of algebras. We then characterize when exactly monotone weak distributive laws over powerset monads in categories of algebras exist, on the one hand exhibiting a law combining probabilities and non-determinism in compact Hausdorff spaces and showing on the other hand that such laws do not exist in a lot of other cases.","accessed":{"date-parts":[["2025",2,25]]},"author":[{"family":"Aristote","given":"Quentin"}],"citation-key":"aristoteMonotoneWeakDistributive2025","collection-title":"Leibniz International Proceedings in Informatics (LIPIcs)","container-title":"42nd International Symposium on Theoretical Aspects of Computer Science (STACS 2025)","DOI":"10.4230/LIPIcs.STACS.2025.10","editor":[{"family":"Beyersdorff","given":"Olaf"},{"family":"Pilipczuk","given":"Michał"},{"family":"Pimentel","given":"Elaine"},{"family":"Thắng","given":"Nguyễn Kim"}],"event-place":"Dagstuhl, Germany","event-title":"Symposium on Theoretical Aspects of Computer Science (STACS)","ISBN":"978-3-95977-365-2","ISSN":"1868-8969","issued":{"date-parts":[["2025"]]},"language":"en","page":"10:1–10:20","publisher":"Schloss Dagstuhl – Leibniz-Zentrum für Informatik","publisher-place":"Dagstuhl, Germany","title":"Monotone Weak Distributive Laws over the Lifted Powerset Monad in Categories of Algebras","type":"paper-conference","URL":"https://drops.dagstuhl.de/entities/document/10.4230/LIPIcs.STACS.2025.10","volume":"327"},
  {"id":"aristoteSmtlibbackendsFasterSMTLIBbased2023","abstract":"Announcement of smtlib-backends, a Haskell library providing a generic interface for interacting with SMT solvers using SMT-LIB.","author":[{"family":"Aristote","given":"Quentin"}],"citation-key":"aristoteSmtlibbackendsFasterSMTLIBbased2023","container-title":"Tweag Blog","issued":{"date-parts":[["2023",2,14]]},"language":"en","title":"smtlib-backends: faster SMT-LIB-based Haskell interface to SMT solvers","title-short":"smtlib-backends","type":"post-weblog","URL":"https://www.tweag.io/blog/2023-02-14-smtlib-backends"}
]
